<!--
 Copyright (C) 2009 GIP RECIA http://www.recia.fr
 @Author (C) 2009 GIP RECIA <contact@recia.fr>
 @Contributor (C) 2009 SOPRA http://www.sopragroup.com/
 @Contributor (C) 2011 Pierre Legay <pierre.legay@recia.fr>

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at
        http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>ESCOGrouper online Help</title>
</head>
<body>
	<div align="center">
        <B>Groupe edition: Privileges</B>
	</div><BR/>

Cet onglet permet de voir, modifier, ajouter ou supprimer des privil&egrave;ges sur le groupe. Il existe 6 privil&egrave;ges possibles :
<ul>
<li><i>A</i> : droit d'administrer le groupe ;</li>
<li><i>M</i> : droit de modifier le groupe, c'est &agrave; dire le droit d'ajouter ou de supprimer des membres ;</li>
<li><i>L</i> : droit de lire le groupe, c'est &agrave; dire de consulter la liste des membres ;</li>
<li><i>V</i> : droit de voir le groupe dans l'arborescence et d'afficher ses propri&eacute;t&eacute;s, mais sans pouvoir lister ses membres ;</li>
<li><i>+</i> : droit de s'abonner au groupe ;</li>
<li><i>-</i> : droit de se d&eacute;sabonner du groupe ;</li>
</ul>
Les droits sont cumulatifs, c'est &agrave; dire, par exemple, qu'un sujet qui a le droit de <i>modifier</i> le groupe aura &eacute;galement le droit de <i>lire</i> et de <i>voir</i> le groupe. Ou encore qu'un sujet qui a le droit de s'<i>abonner</i> au groupe aura le droit de <i>voir</i> ce groupe.<BR/>
L'utilisateur qui cr&eacute;e le groupe aura par d&eacute;faut le droit d'<i>administrer</i> ce groupe.<BR/><BR/>

Une liste de choix permet d'acc&eacute;der aux :
<ul>
<li><i>Privil&egrave;ves directs</i> : privil&egrave;ges que poss&egrave;dent directement des sujets (individus ou groupes) sur le groupe ;</i>
<li><i>Privil&egrave;ges indirects</i> : privil&egrave;ges que poss&egrave;dent indirectement des sujets sur le groupe (parce qu'ils font partie d'un groupe qui a des privil&egrave;ges sur le groupe) ;</li>
<li><i>Privil&egrave;ges directs et indirects</i> : privil&egrave;ges directs et indirects que poss&egrave;dent des sujets sur le groupe.</li>
</ul>
Lorsque l'utilisateur s&eacute;lectionne les <i>privil&egrave;ges directs</i>, il peut modifier, ajouter ou supprimer des privil&egrave;ges.<BR/><BR/>
Pour modifier les privil&egrave;ges d'un sujet sur le groupe, il suffit de cliquer sur les cases &agrave; cocher correspondantes dans le tableau.<BR/><BR/>

Pour ajouter des privil&egrave;ges &agrave; un nouveau sujet, il faut cliquer sur "<img src="../images/add.png"> <i>Ajout</i>" et rechercher le sujet concern&eacute;. Une fois la recherche effectu&eacute;e ESCO-Grouper revient sur l'onglet "<img src="../images/editGroup_privileges.png"/> <i>Privil&egrave;ges</i>" et le nouveau sujet est affich&eacute; en vert dans la liste. Il suffit ensuite de cocher les privil&egrave;ges souhait&eacute;s pour ce sujet.<BR/><BR/>

Pour supprimer tous les privil&egrave;ges d'un sujet sur le groupe, il faut s&eacute;lectionner ce sujet dans le tableau et cliquer sur "<img src="../images/supp.png"/> <i>Supprimer</i>".<BR/><BR/>

Le bouton "<img src="../images/save.png"> <i>Enregistrer</i>" permet d'acc&eacute;der &agrave; la page de r&eacute;capitulation des op&eacute;rations effectu&eacute;es. Une validation de cette page enregistre la cr&eacute;ation ou les modifications.<BR/>
Le bouton "<img src="../images/cancel.png"> <i>Annuler</i>" permet d'annuler les op&eacute;rations en cours et de revenir sur la page des "<img src="../images/editGroup_attributes.png"/> <i>Attributs</i>", avec les informations pr&eacute;c&eacute;demment saisies.<BR/><BR/>

Si l'utilisateur quitte l'&eacute;dition du groupe (par exemple en cliquant sur un autre groupe dans la zone de navigation), un message lui propose d'enregistrer les modifications ou de les annuler.<BR/><BR/>



</body>
</html>
