<!--
 Copyright (C) 2009 GIP RECIA http://www.recia.fr
 @Author (C) 2009 GIP RECIA <contact@recia.fr>
 @Contributor (C) 2009 SOPRA http://www.sopragroup.com/
 @Contributor (C) 2011 Pierre Legay <pierre.legay@recia.fr>

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at
        http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>ESCOGrouper online Help</title>
</head>
<body>
	<div align="center">
        <B>Folder search</B>
	</div><BR/>
Cette page permet de rechercher un dossier dans une arborescence.<BR/>
L'utilisateur pr&eacute;cise les &eacute;l&eacute;ments n&eacute;cessaires &agrave; la recherche et clique sur le bouton "<img src="../images/search_search.png"/> <i>Recherche</i>" pour lancer la recherche.<BR/>
Le r&eacute;sultat de la recherche s'affiche dans un tableau. L'utilisateur peut alors choisir le(s) dossier(s) qu'il souhaite gr&acirc;ce &agrave;(aux) case(s) &agrave; cocher, avant de cliquer sur le bouton "<img src="../images/search_add.png"/> <i>Ajouter</i>" pour ramener sa s&eacute;lection vers l'op&eacute;ration en cours.<BR/>
Si l'utilisateur clique sur le bouton "<img src="../images/search_back.png"/> <i>Retour</i>", il revient &agrave; l'op&eacute;ration en cours sans ramener un r&eacute;sultat de recherche.<BR/><BR/>

Il y a diff&eacute;rents &eacute;l&eacute;ments qui sont n&eacute;cessaires &agrave; la recherche et que l'utilisateur aura &agrave; pr&eacute;ciser pour obtenir le r&eacute;sultat souhait&eacute;.<BR/>
<b>Terme de recherche</b> :<BR/>
Dans cette zone, l'utilisateur entre une chaine de recherche. L'utilisateur peut utiliser le caract&egrave;re "<i>*</i>" pour remplacer tout caract&egrave;re. Par exemple, pour rechercher tous les dossiers dont l'extension commence par "<i>Etab</i>", l'utilisateur entrera "<i>Etab*</i>" dans la zone "<i>Terme de recherche</i>".<BR/><BR/>


<b>A partir de</b> :<BR/>
Ici, l'utilisateur s&eacute;lectionne le dossier &agrave; partir duquel s'effectuera la recherche. Par d&eacute;faut, le dossier s&eacute;lectionn&eacute; est le dossier courant, c'est &agrave; dire celui &agrave; partir duquel l'utilsateur a demand&eacute; la recherche. Si l'utilisateur souhaite effectuer la recherche sur toute l'arborescence, il cliquera sur le symbole <img src="../images/search_home.png"/>.<BR/><BR>

<b>Crit&egrave;re de recherche</b>" :<BR/>
Cette zone permet de pr&eacute;ciser sur quelle partie du nom du dossier le <i>terme de recherche</i> sera recherch&eacute;.<BR/>
Un dossier poss&egrave;de un <i>Nom</i> et  un <i>Nom affich&eacute;</i>.<BR/>
Le <i>Nom</i> d'un dossier est le nom complet par lequel il est enregistr&eacute; dans le gestionnaire de groupes Grouper.</B>
Le <i>Nom affich&eacute;</i> est le nom complet du dossier tel qu'il appara&icirc;t dans l'arborescence de ESCO-Grouper.<BR>
L'<i>Extention affich&eacute;e</i> d'un dossier est le dernier &eacute;l&eacute;ment de son <i>Nom affich&eacute;</i>.<BR>
Prenons l'exemple du dossier qui a pour <i>Extension affich&eacute;e</i> "<i>Administration locale du cahier de texte"</i>. Le <i>nom</i> de ce dossier est "<i>esco:admin:CAHIER_TEXTE_CAEN:local</i>" et son <i>Nom affich&eacute;</i> est "<i>ESCO:Admin:Cahier de texte:Administration locale du cahier de texte</i>".
</body>
</html>
