<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>Aide en ligne ESCOGrouper</title>
</head>
<body>
	<div align="center">
        <B>Zone de naviguation</B>
	</div><BR/>
Cette zone permet de naviguer dans l'arborescence des dossiers et des groupes. Sa largeur est ajustable et elle peut &ecirc;tre cach&eacute;e en cliquant sur le bouton <img src="../images/nav_hide.png"/><BR/>
Pour retrouver la zone de navigation, il suffit de cliquer sur le bouton <img src="../images/nav_view.png"/><BR/>
L'arborescence n'affiche pas les membres des groupes (sous-groupes ou individus).<BR/>
<BR/>
Vous pouvez d&eacute;plier ou replier une branche de l'arbre en cliquant sur les boutons <img src="../images/nav_plus.png"/> et <img src="../images/nav_minus.png"/> &agrave; c&ocirc;t&eacute; des noms des dossiers.<BR/>
Un survol sur une ic&ocirc;ne associ&eacute;e &agrave; un dossier (<img src="../images/nav_stem.png"/>) ou un groupe (<img src="../images/nav_group.png"/>) vous permet de savoir quels sont vos droits sur ce dossier ou ce groupe.<BR/>
Un clic droit sur le nom d'un dossier/groupe vous permet d'obtenir un menu contextuel qui propose les actions permises sur ce dossier/groupe :
<ul>
<li><img src="../images/nav_createStem.png"/> <i>Cr&eacute;er un dossier</i> : cr&eacute;er un dossier dans le dossier s&eacute;lectionn&eacute;</li>
<li><img src="../images/nav_createGroup.png"/> <i>Cr&eacute;er un groupe</i> : cr&eacute;er un groupe dans le dossier s&eacute;lectionn&eacute;</li>
<li><img src="../images/nav_copyGroup.png"/> <i>Copier le groupe</i> : copie le groupe pr&eacute;c&eacute;demment coup&eacute; dans le dossier s&eacute;lectionn&eacute;</li>
<li><img src="../images/nav_research.png"/> <i>Rechercher</i> : rechercher un individu ou un groupe, &agrave; partir du dossier s&eacute;lectionn&eacute; ou du dossier p&egrave;re du groupe s&eacute;lectionn&eacute;</li>
<li><img src="../images/nav_delete.png"/> <i>Supprimer</i> : supprimer le dossier/groupe s&eacute;lectionn&eacute;</li>
<li><img src="../images/nav_admin.png"/> <i>Administrer</i> : modifier les caract&eacute;ristiques du dossier/groupe</li>
<li><img src="../images/nav_properties.png"/> <i>Propri&eacute;t&eacute;s</i> : afficher les propri&eacute;t&eacute;s d'un dossier/groupe</li>
<li><img src="../images/nav_subscribe.png"/> <i>S'abonner</i> : s'abonner au groupe s&eacute;lectionn&eacute;</li>
<li><img src="../images/nav_unsubscribe.png"/> <i>Se d&eacute;sabonner</i> : se d&eacute;sabonner du groupe s&eacute;lectionn&eacute;</li>
<li><img src="../images/nav_cutGroup.png"/> <i>Couper le groupe</i> : Coupe le groupe du dossier dans lequel il est plac&eacute; pour le copier ailleurs</li>
<li><img src="../images/nav_copyMembers.png"/> <i>Copier les membres</i> : copier les membres du groupe s&eacute;lectionn&eacute; pour pouvoir les ins&eacute;rer dans autre</li>
<li><img src="../images/nav_pasteMembers.png"/> <i>Coller les membres</i> : coller les membres copi&eacute;s ant&eacute;rieurement dans le groupe s&eacute;lectionn&eacute;</li>
</ul>
L'opération <i>Couper/copier un groupe</i> peut s'effectuer par glisser/déplacer dans l'arborescence.<BR/>
Dans l'arborescence, vous ne pouvez voir que les groupes (<img src="../images/nav_group.png"/>) pour lesquels vous avez au minimum le droit <i>"voir"</i>.<BR/>
Par contre, sur les dossiers (<img src="../images/nav_stem.png"/>), il n'y a pas de droit <i>"voir"</i> (seuls les droits <i>"Cr&eacute;er Dossier"</i> et <i>"Cr&eacute;er Groupe"</i> peuvent &ecirc;tre positionn&eacute;s) ; les dossiers sont donc affich&eacute;s m&ecirc;me si vous n'avez pas de droit dessus : ce n'est pas parce que vous n'avez pas le droit de cr&eacute;er un groupe ou un dossier sous un dossier que vous ne pouvez pas voir un groupe de ce dossier.<BR/>
<BR/>
Le bouton <img src="../images/nav_homeFr.png"/> permet de revenir sur la page d'accueil (propri&eacute;t&eacute;s de l'utilisateur connect&eacute;).<BR/>
Le bouton <img src="../images/nav_search.png"/> vous am&egrave;ne sur la page <i>Recherche</i>. De cette page vous pouvez rechercher un sujet (individu ou groupe).
</body>
</html>
