<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>Aide en ligne ESCOGrouper</title>
</head>
<body>
	<div align="center">
        <B>Propri&eacute;t&eacute;s d'un individu : Privil&egrave;ges</B>
	</div><BR/>
Dans cet onglet, ESCO-Grouper affiche les privil&egrave;ges que poss&egrave;de l'individu sur des dossiers ou des groupes. Le fait de voir les privil&egrave;ges sur les dossiers ou les groupes s'effectue gr&acirc;ce &agrave; une des deux listes de choix.<BR/><BR/>
L'autre liste de choix permet d'affcher :
<ul>
<li>les <i>Privil&egrave;ges directs</i> : privil&egrave;ges attribu&eacute;s directement &agrave; l'individu sur des dossiers ou des groupes ;<li>
<li>les <i>Privil&egrave;ges indirects</i> : privil&egrave;ges attribu&eacute;s indirectement &agrave; l'individu (parce qu'il est membre d'un groupe qui poss&egrave;de des privil&egrave;ges) sur des dossiers ou des groupes ;</li>
<li> les <i>privil&egrave;ges directs et indirects</i> : privil&egrave;ges attribu&eacute;s directement ou indirectement &agrave; l'individu sur des dossiers ou des groupes.</li>
</ul>
Le tableau affiche donc la liste des dossiers ou des groupes sur lesquels l'individu a des privil&egrave;ges.<BR/><BR/>
Les privil&egrave;ges possibles sur les dossiers sont :
<ul>
<li><i>CD</i> : droit de cr&eacute;er un dossier dans le dossier ;</li>
<li><i>CG</i> : drout de cr&eacute;er un groupe dans le dossier.</li>
</ul>
Les privil&egrave;ges possibles sur les groupes sont :
<ul>
<li><i>A</i> : droit d'administrer le groupe ;</li>
<li><i>M</i> : droit de modifier le groupe, c'est &agrave; dire le droit d'ajouter ou de supprimer des membres ;</li>
<li><i>L</i> : droit de lire le groupe, c'est &agrave; dire de consulter la liste des membres ;</li>
<li><i>V</i> : droit de voir le groupe dans l'arborescence et d'afficher ses propri&eacute;t&eacute;s, mais sans pouvoir lister ses membres ;</li>
<li><i>+</i> : droit de s'abonner au groupe ;</li>
<li><i>-</i> : droit de se d&eacute;sabonner du groupe ;</li>
</ul>
Les droits sur les groupes sont cumulatifs, c'est &agrave; dire, par exemple, qu'un sujet qui a le droit de <i>modifier</i> un groupe aura &eacute;galement le droit de <i>lire</i> et de <i>voir</i> ce groupe. Ou encore qu'un sujet qui a le droit de s'<i>abonner</i> &agrave; un groupe groupe aura le droit de <i>voir</i> ce groupe.<BR/><BR/>

En fonction des droits de l'utilisateur connect&eacute;, et lorsque <i>Privil&egrave;ges directs</i> est choisi, il est possible d'ajouter ou de supprimer des privil&egrave;ges &agrave; l'individu.<BR/><BR/>
Dans la liste des dossiers/groupes affich&eacute;s, il est possible d'ajouter ou de retirer des privil&egrave;ges en cochant ou d&eacute;cochant les cases dans les colonnes des droits.<BR/><BR/>
Pour ajouter des privil&egrave;ges &agrave; l'individu sur un nouveau dossier/groupe, il faut cliquer sur "<img src="../images/add.png"> <i>Ajout</i>" et rechercher le dossier/groupe concern&eacute;. Une fois la recherche effectu&eacute;e ESCO-Grouper revient sur l'onglet "<img src="../images/persProp_privileges.png"/> <i>Privil&egrave;ges</i>" et le nouveau dossier/groupe est affich&eacute; en vert dans la liste. Il suffit ensuite de cocher les privil&egrave;ges souhait&eacute;s pour l'individu.<BR/><BR/>
Pour supprimer tous les privil&egrave;ges de l'individu sur un dossier/groupe, il faut s&eacute;lectionner ce dossier/groupe dans la liste et cliquer sur "<img src="../images/supp.png"/> <i>Supprimer</i>".
</body>
</html>
