<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>ESCOGrouper online Help</title>
</head>
<body>
	<div align="center">
        <B>Simple search</B>
	</div><BR/>

Cette page permet de rechercher un sujet, c'est &agrave; dire un individu ou un groupe.<BR/>
L'utilisateur pr&eacute;cise les &eacute;l&eacute;ments n&eacute;cessaires &agrave; la recherche et clique sur le bouton "<img src="../images/search_search.png"/> <i>Recherche</i>" pour lancer la recherche.<BR/>
Le r&eacute;sultat de la recherche s'affiche dans un tableau.<BR/>
L'utilisateur peut alors cliquer sur le nom d'un sujet pour acc&eacute;der aux propri&eacute;t&eacute;s de ce sujet.<BR/><BR/>

<B>Pour rechercher un individu</B>, l'utilisateur indique le nom, &eacute;ventuellement suivi d'un blanc et du pr&eacute;nom, de l'individu recherch&eacute; dans la zone "<i>Terme de recherche</i>". L'utilisateur peut utiliser le caract&egrave;re "<i>*</i>" pour remplacer tout caract&egrave;re. Par exemple, pour rechercher tous les individus dont le nom commence par "<i>Tar</i>", l'utilisateur entrera "<i>Tar*</i>" dans la zone "<i>Terme de recherche</i>".<BR/><BR/>

<B>Pour rechercher un groupe</B>, plusieurs &eacute;l&eacute;ments seront &agrave; pr&eacute;ciser.<BR/>
<b>Terme de recherche</b> :<BR/>
Dans cette zone, l'utilisateur entre une chaine de recherche. L'utilisateur peut utiliser le caract&egrave;re "<i>*</i>" pour remplacer tout caract&egrave;re. Par exemple, pour rechercher tous les groupes dont l'extension commence par "<i>Prof</i>", l'utilisateur entrera "<i>Prof*</i>" dans la zone "<i>Terme de recherche</i>".<BR/>

<b>A partir de</b> :<BR/>
Dans une recherche simple, toute l'arborescence est explor&eacute;e. De fait, le symbole <img src="../images/search_home.png"/> est affich&eacute; et ne peut &egrave;tre modifi&eacute;.<BR/>

<b>Crit&egrave;re de recherche</b>" :<BR/>
Cette zone permet de pr&eacute;ciser sur quelle partie du nom du groupe le <i>terme de recherche</i> sera recherch&eacute;.<BR/>
Un groupe poss&egrave;de un <i>Nom</i> et  un <i>Nom affich&eacute;</i>.<BR/>
Le <i>Nom</i> d'un groupe est le nom complet par lequel il est enregistr&eacute; dans le gestionnaire de groupes Grouper.</B>
Le <i>Nom affich&eacute;</i> est le nom complet du groupe tel qu'il appara&icirc;t dans l'arborescence de ESCO-Grouper.<BR>
L'<i>Extention affich&eacute;e</i> d'un groupe est le dernier &eacute;l&eacute;ment de son <i>Nom affich&eacute;</i>.<BR>
Prenons l'exemple d'un groupe qui a pour <i>Extension affich&eacute;e</i> "<i>CLAUDE DE FRANCE</i>" et qui est contenu dans le dossier "<i>ESCO:Admin:Cahier de texte:Administration locale du cahier de texte</i>". Le <i>nom</i> de ce groupe est "<i>esco:admin:CAHIER_TEXTE_CAEN:local:CLAUDE DE FRANCE_0410017W</i>" et son <i>Nom affich&eacute;</i> est "<i>ESCO:Admin:Cahier de texte:Administration locale du cahier de texte:CLAUDE DE FRANCE</i>".
</body>
</html>
